Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS502.h
extern volatile ADTRIG11BITS ADTRIG11bits __attribute__((__sfr__));

#define ADTRIG13 ADTRIG13
extern volatile unsigned int  ADTRIG13 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG13BITS {
  union {
    struct {
      unsigned :8;
      unsigned TRGSRC25:5;
    };
    struct {
      unsigned :8;
      unsigned TRGSRC250:1;
      unsigned TRGSRC251:1;
      unsigned TRGSRC252:1;
      unsigned TRGSRC253:1;
      unsigned TRGSRC254:1;
    };
  };
} ADTRIG13BITS;
extern volatile ADTRIG13BITS ADTRIG13bits __attribute__((__sfr__));

#define ADTRIG14 ADTRIG14
extern volatile unsigned int  ADTRIG14 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG14BITS {
  union {
    struct {
      unsigned TRGSRC26:5;
    };
    struct {
      unsigned TRGSRC260:1;
      unsigned TRGSRC261:1;
      unsigned TRGSRC262:1;
      unsigned TRGSRC263:1;
      unsigned TRGSRC264:1;
    };
  };
} ADTRIG14BITS;
extern volatile ADTRIG14BITS ADTRIG14bits __attribute__((__sfr__));

#define DCMP1CON DCMP1CON
extern volatile unsigned int  DCMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagDCMP1CONBITS {
  union {
    struct {
      unsigned IELOLO:1;
      unsigned IELOHI:1;
      unsigned IEHILO:1;
      unsigned IEHIHI:1;
      unsigned IEBTWN:1;
      unsigned DCMPED:1;
      unsigned DCMPGIEN:1;
      unsigned DCMPEN:1;
      unsigned AINID:5;
    };
    struct {
      unsigned :8;
      unsigned AINID0:1;
      unsigned AINID1:1;
      unsigned AINID2:1;
      unsigned AINID3:1;
      unsigned AINID4:1;
    };
  };
} DCMP1CONBITS;
extern volatile DCMP1CONBITS DCMP1CONbits __attribute__((__sfr__));

#define DCMP2CON DCMP2CON
extern volatile unsigned int  DCMP2CON __attribute__((__sfr__));
__extension__ typedef struct tagDCMP2CONBITS {
  union {
    struct {
      unsigned IELOLO:1;
      unsigned IELOHI:1;
      unsigned IEHILO:1;
      unsigned IEHIHI:1;
      unsigned IEBTWN:1;
      unsigned DCMPED:1;
      unsigned DCMPGIEN:1;
      unsigned DCMPEN:1;
      unsigned AINID:5;
    };
    struct {
      unsigned :8;
      unsigned AINID0:1;
      unsigned AINID1:1;
      unsigned AINID2:1;
      unsigned AINID3:1;
      unsigned AINID4:1;
    };
  };
} DCMP2CONBITS;
extern volatile DCMP2CONBITS DCMP2CONbits __attribute__((__sfr__));

#define ADBASE ADBASE
extern volatile unsigned int  ADBASE __attribute__((__sfr__));
#define ADCBUF0 ADCBUF0
extern volatile unsigned int  ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile unsigned int  ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile unsigned int  ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile unsigned int  ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile unsigned int  ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile unsigned int  ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile unsigned int  ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile unsigned int  ADCBUF7 __attribute__((__sfr__));
#define ADCBUF17 ADCBUF17
extern volatile unsigned int  ADCBUF17 __attribute__((__sfr__));
#define ADCBUF18 ADCBUF18
extern volatile unsigned int  ADCBUF18 __attribute__((__sfr__));
#define ADCBUF19 ADCBUF19
extern volatile unsigned int  ADCBUF19 __attribute__((__sfr__));
#define ADCBUF20 ADCBUF20
extern volatile unsigned int  ADCBUF20 __attribute__((__sfr__));
#define ADCBUF21 ADCBUF21
extern volatile unsigned int  ADCBUF21 __attribute__((__sfr__));
#define ADCBUF25 ADCBUF25
extern volatile unsigned int  ADCBUF25 __attribute__((__sfr__));
#define ADCBUF26 ADCBUF26
extern volatile unsigned int  ADCBUF26 __attribute__((__sfr__));
#define ISRCCON ISRCCON
extern volatile unsigned int  ISRCCON __attribute__((__sfr__));
__extension__ typedef struct tagISRCCONBITS {
  union {
    struct {
      unsigned ISRCCAL:6;
      unsigned :2;
      unsigned OUTSEL:3;
      unsigned :4;
      unsigned ISRCEN:1;
    };
    struct {
      unsigned ISRCCAL0:1;
      unsigned ISRCCAL1:1;
      unsigned ISRCCAL2:1;
      unsigned ISRCCAL3:1;
      unsigned ISRCCAL4:1;
      unsigned ISRCCAL5:1;
      unsigned :2;
      unsigned OUTSEL0:1;
      unsigned OUTSEL1:1;
      unsigned OUTSEL2:1;
    };
  };
} ISRCCONBITS;
extern volatile ISRCCONBITS ISRCCONbits __attribute__((__sfr__));

#define PGA1CON PGA1CON
extern volatile unsigned int  PGA1CON __attribute__((__sfr__));
__extension__ typedef struct tagPGA1CONBITS {
  union {
    struct {
      unsigned GAIN:3;
      unsigned :5;
      unsigned SELNI:3;
      unsigned SELPI:3;
      unsigned PGAOEN:1;
      unsigned PGAEN:1;
    };
    struct {
      unsigned GAIN0:1;
      unsigned GAIN1:1;
      unsigned GAIN2:1;
      unsigned :5;
      unsigned SELNI0:1;
      unsigned SELNI1:1;
      unsigned SELNI2:1;
      unsigned SELPI0:1;
      unsigned SELPI1:1;
      unsigned SELPI2:1;
    };
  };
} PGA1CONBITS;
extern volatile PGA1CONBITS PGA1CONbits __attribute__((__sfr__));

#define PGA1CAL PGA1CAL
extern volatile unsigned int  PGA1CAL __attribute__((__sfr__));
typedef struct tagPGA1CALBITS {
  unsigned PGACAL:6;
} PGA1CALBITS;
extern volatile PGA1CALBITS PGA1CALbits __attribute__((__sfr__));

#define PGA2CON PGA2CON
extern volatile unsigned int  PGA2CON __attribute__((__sfr__));
__extension__ typedef struct tagPGA2CONBITS {
  union {
    struct {
      unsigned GAIN:3;
      unsigned :5;
      unsigned SELNI:3;
      unsigned SELPI:3;
      unsigned PGAOEN:1;
      unsigned PGAEN:1;
    };
    struct {
      unsigned GAIN0:1;
      unsigned GAIN1:1;
      unsigned GAIN2:1;
      unsigned :5;
      unsigned SELNI0:1;
      unsigned SELNI1:1;
      unsigned SELNI2:1;
      unsigned SELPI0:1;
      unsigned SELPI1:1;
      unsigned SELPI2:1;
    };
  };
} PGA2CONBITS;
extern volatile PGA2CONBITS PGA2CONbits __attribute__((__sfr__));

#define PGA2CAL PGA2CAL
extern volatile unsigned int  PGA2CAL __attribute__((__sfr__));
typedef struct tagPGA2CALBITS {
  unsigned PGACAL:6;
} PGA2CALBITS;
