Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS502.h
/* ADCSSL */
#define _CSS0 ADCSSLbits.CSS0
#define _CSS1 ADCSSLbits.CSS1
#define _CSS2 ADCSSLbits.CSS2
#define _CSS3 ADCSSLbits.CSS3
#define _CSS4 ADCSSLbits.CSS4
#define _CSS5 ADCSSLbits.CSS5
#define _CSS6 ADCSSLbits.CSS6
#define _CSS7 ADCSSLbits.CSS7

/* ADCSSH */
#define _CSS17 ADCSSHbits.CSS17
#define _CSS18 ADCSSHbits.CSS18
#define _CSS19 ADCSSHbits.CSS19
#define _CSS20 ADCSSHbits.CSS20
#define _CSS21 ADCSSHbits.CSS21
#define _CSS25 ADCSSHbits.CSS25
#define _CSS26 ADCSSHbits.CSS26

/* ADSTATL */
#define _AN0RDY ADSTATLbits.AN0RDY
#define _AN1RDY ADSTATLbits.AN1RDY
#define _AN2RDY ADSTATLbits.AN2RDY
#define _AN3RDY ADSTATLbits.AN3RDY
#define _AN4RDY ADSTATLbits.AN4RDY
#define _AN5RDY ADSTATLbits.AN5RDY
#define _AN6RDY ADSTATLbits.AN6RDY
#define _AN7RDY ADSTATLbits.AN7RDY

/* ADSTATH */
#define _AN17RDY ADSTATHbits.AN17RDY
#define _AN18RDY ADSTATHbits.AN18RDY
#define _AN19RDY ADSTATHbits.AN19RDY
#define _AN20RDY ADSTATHbits.AN20RDY
#define _AN21RDY ADSTATHbits.AN21RDY
#define _AN25RDY ADSTATHbits.AN25RDY
#define _AN26RDY ADSTATHbits.AN26RDY

/* DCMP1ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */

/* DCMP1ENH */
/* Bitname _CMPEN17 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN18 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN19 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN20 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN21 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN25 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN26 cannot be defined because it is used by more than one SFR */

/* DCMP2ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */

/* DCMP2ENH */
/* Bitname _CMPEN17 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN18 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN19 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN20 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN21 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN25 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN26 cannot be defined because it is used by more than one SFR */

/* ADFLTR1CON */
/* Bitname _CHNLID cannot be defined because it is used by more than one SFR */
/* Bitname _AFRDY cannot be defined because it is used by more than one SFR */
/* Bitname _AFGIEN cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM cannot be defined because it is used by more than one SFR */
/* Bitname _AFEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID4 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID5 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM2 cannot be defined because it is used by more than one SFR */

/* ADFLTR2CON */
/* Bitname _CHNLID cannot be defined because it is used by more than one SFR */
/* Bitname _AFRDY cannot be defined because it is used by more than one SFR */
/* Bitname _AFGIEN cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM cannot be defined because it is used by more than one SFR */
/* Bitname _AFEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID4 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID5 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM2 cannot be defined because it is used by more than one SFR */

/* ADTRIG1 */
#define _TRGSRC0 ADTRIG1bits.TRGSRC0
#define _TRGSRC1 ADTRIG1bits.TRGSRC1
#define _TRGSRC00 ADTRIG1bits.TRGSRC00
#define _TRGSRC01 ADTRIG1bits.TRGSRC01
#define _TRGSRC02 ADTRIG1bits.TRGSRC02
#define _TRGSRC03 ADTRIG1bits.TRGSRC03
#define _TRGSRC04 ADTRIG1bits.TRGSRC04
#define _TRGSRC10 ADTRIG1bits.TRGSRC10
#define _TRGSRC11 ADTRIG1bits.TRGSRC11
#define _TRGSRC12 ADTRIG1bits.TRGSRC12
#define _TRGSRC13 ADTRIG1bits.TRGSRC13
#define _TRGSRC14 ADTRIG1bits.TRGSRC14

/* ADTRIG2 */
#define _TRGSRC2 ADTRIG2bits.TRGSRC2
#define _TRGSRC3 ADTRIG2bits.TRGSRC3
/* Bitname _TRGSRC20 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC21 cannot be defined because it is used by more than one SFR */
#define _TRGSRC22 ADTRIG2bits.TRGSRC22
#define _TRGSRC23 ADTRIG2bits.TRGSRC23
#define _TRGSRC24 ADTRIG2bits.TRGSRC24
#define _TRGSRC30 ADTRIG2bits.TRGSRC30
#define _TRGSRC31 ADTRIG2bits.TRGSRC31
#define _TRGSRC32 ADTRIG2bits.TRGSRC32
#define _TRGSRC33 ADTRIG2bits.TRGSRC33
#define _TRGSRC34 ADTRIG2bits.TRGSRC34

