Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS502.h
#define _ADMOD_SH3MOD0_POSITION                  0x00000006
#define _ADMOD_SH3MOD0_MASK                      0x00000040
#define _ADMOD_SH3MOD0_LENGTH                    0x00000001

#define _ADMOD_SH3MOD1_POSITION                  0x00000007
#define _ADMOD_SH3MOD1_MASK                      0x00000080
#define _ADMOD_SH3MOD1_LENGTH                    0x00000001

#define _ADMOD_SH4MOD0_POSITION                  0x00000008
#define _ADMOD_SH4MOD0_MASK                      0x00000100
#define _ADMOD_SH4MOD0_LENGTH                    0x00000001

#define _ADMOD_SH4MOD1_POSITION                  0x00000009
#define _ADMOD_SH4MOD1_MASK                      0x00000200
#define _ADMOD_SH4MOD1_LENGTH                    0x00000001

#define _ADALT_SH0ALT_POSITION                   0x00000000
#define _ADALT_SH0ALT_MASK                       0x00000003
#define _ADALT_SH0ALT_LENGTH                     0x00000002

#define _ADALT_SH1ALT_POSITION                   0x00000002
#define _ADALT_SH1ALT_MASK                       0x0000000C
#define _ADALT_SH1ALT_LENGTH                     0x00000002

#define _ADALT_SH2ALT_POSITION                   0x00000004
#define _ADALT_SH2ALT_MASK                       0x00000030
#define _ADALT_SH2ALT_LENGTH                     0x00000002

#define _ADALT_SH3ALT_POSITION                   0x00000006
#define _ADALT_SH3ALT_MASK                       0x000000C0
#define _ADALT_SH3ALT_LENGTH                     0x00000002

#define _ADALT_SH0ALT0_POSITION                  0x00000000
#define _ADALT_SH0ALT0_MASK                      0x00000001
#define _ADALT_SH0ALT0_LENGTH                    0x00000001

#define _ADALT_SH0ALT1_POSITION                  0x00000001
#define _ADALT_SH0ALT1_MASK                      0x00000002
#define _ADALT_SH0ALT1_LENGTH                    0x00000001

#define _ADALT_SH1ALT0_POSITION                  0x00000002
#define _ADALT_SH1ALT0_MASK                      0x00000004
#define _ADALT_SH1ALT0_LENGTH                    0x00000001

#define _ADALT_SH1ALT1_POSITION                  0x00000003
#define _ADALT_SH1ALT1_MASK                      0x00000008
#define _ADALT_SH1ALT1_LENGTH                    0x00000001

#define _ADALT_SH2ALT0_POSITION                  0x00000004
#define _ADALT_SH2ALT0_MASK                      0x00000010
#define _ADALT_SH2ALT0_LENGTH                    0x00000001

#define _ADALT_SH2ALT1_POSITION                  0x00000005
#define _ADALT_SH2ALT1_MASK                      0x00000020
#define _ADALT_SH2ALT1_LENGTH                    0x00000001

#define _ADALT_SH3ALT0_POSITION                  0x00000006
#define _ADALT_SH3ALT0_MASK                      0x00000040
#define _ADALT_SH3ALT0_LENGTH                    0x00000001

#define _ADALT_SH3ALT1_POSITION                  0x00000007
#define _ADALT_SH3ALT1_MASK                      0x00000080
#define _ADALT_SH3ALT1_LENGTH                    0x00000001

#define _ADGIRQENL_IRQEN0_POSITION               0x00000000
#define _ADGIRQENL_IRQEN0_MASK                   0x00000001
#define _ADGIRQENL_IRQEN0_LENGTH                 0x00000001

#define _ADGIRQENL_IRQEN1_POSITION               0x00000001
#define _ADGIRQENL_IRQEN1_MASK                   0x00000002
#define _ADGIRQENL_IRQEN1_LENGTH                 0x00000001

#define _ADGIRQENL_IRQEN2_POSITION               0x00000002
#define _ADGIRQENL_IRQEN2_MASK                   0x00000004
#define _ADGIRQENL_IRQEN2_LENGTH                 0x00000001

#define _ADGIRQENL_IRQEN3_POSITION               0x00000003
#define _ADGIRQENL_IRQEN3_MASK                   0x00000008
#define _ADGIRQENL_IRQEN3_LENGTH                 0x00000001

#define _ADGIRQENL_IRQEN4_POSITION               0x00000004
#define _ADGIRQENL_IRQEN4_MASK                   0x00000010
#define _ADGIRQENL_IRQEN4_LENGTH                 0x00000001

#define _ADGIRQENL_IRQEN5_POSITION               0x00000005
#define _ADGIRQENL_IRQEN5_MASK                   0x00000020
#define _ADGIRQENL_IRQEN5_LENGTH                 0x00000001

#define _ADGIRQENL_IRQEN6_POSITION               0x00000006
#define _ADGIRQENL_IRQEN6_MASK                   0x00000040
#define _ADGIRQENL_IRQEN6_LENGTH                 0x00000001

#define _ADGIRQENL_IRQEN7_POSITION               0x00000007
#define _ADGIRQENL_IRQEN7_MASK                   0x00000080
#define _ADGIRQENL_IRQEN7_LENGTH                 0x00000001

#define _ADGIRQENH_IRQEN17_POSITION              0x00000001
#define _ADGIRQENH_IRQEN17_MASK                  0x00000002
#define _ADGIRQENH_IRQEN17_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN18_POSITION              0x00000002
#define _ADGIRQENH_IRQEN18_MASK                  0x00000004
#define _ADGIRQENH_IRQEN18_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN19_POSITION              0x00000003
#define _ADGIRQENH_IRQEN19_MASK                  0x00000008
#define _ADGIRQENH_IRQEN19_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN20_POSITION              0x00000004
#define _ADGIRQENH_IRQEN20_MASK                  0x00000010
#define _ADGIRQENH_IRQEN20_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN21_POSITION              0x00000005
#define _ADGIRQENH_IRQEN21_MASK                  0x00000020
#define _ADGIRQENH_IRQEN21_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN25_POSITION              0x00000009
#define _ADGIRQENH_IRQEN25_MASK                  0x00000200
#define _ADGIRQENH_IRQEN25_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN26_POSITION              0x0000000A
#define _ADGIRQENH_IRQEN26_MASK                  0x00000400
#define _ADGIRQENH_IRQEN26_LENGTH                0x00000001

#define _ADCSSL_CSS0_POSITION                    0x00000000
#define _ADCSSL_CSS0_MASK                        0x00000001
#define _ADCSSL_CSS0_LENGTH                      0x00000001

#define _ADCSSL_CSS1_POSITION                    0x00000001
#define _ADCSSL_CSS1_MASK                        0x00000002
#define _ADCSSL_CSS1_LENGTH                      0x00000001

#define _ADCSSL_CSS2_POSITION                    0x00000002
#define _ADCSSL_CSS2_MASK                        0x00000004
#define _ADCSSL_CSS2_LENGTH                      0x00000001

#define _ADCSSL_CSS3_POSITION                    0x00000003
#define _ADCSSL_CSS3_MASK                        0x00000008
#define _ADCSSL_CSS3_LENGTH                      0x00000001

#define _ADCSSL_CSS4_POSITION                    0x00000004
#define _ADCSSL_CSS4_MASK                        0x00000010
#define _ADCSSL_CSS4_LENGTH                      0x00000001

#define _ADCSSL_CSS5_POSITION                    0x00000005
#define _ADCSSL_CSS5_MASK                        0x00000020
#define _ADCSSL_CSS5_LENGTH                      0x00000001

#define _ADCSSL_CSS6_POSITION                    0x00000006
#define _ADCSSL_CSS6_MASK                        0x00000040
#define _ADCSSL_CSS6_LENGTH                      0x00000001

