Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS502.h
#define _ADFLTR2CON_CHNLID3_POSITION             0x00000003
#define _ADFLTR2CON_CHNLID3_MASK                 0x00000008
#define _ADFLTR2CON_CHNLID3_LENGTH               0x00000001

#define _ADFLTR2CON_CHNLID4_POSITION             0x00000004
#define _ADFLTR2CON_CHNLID4_MASK                 0x00000010
#define _ADFLTR2CON_CHNLID4_LENGTH               0x00000001

#define _ADFLTR2CON_CHNLID5_POSITION             0x00000005
#define _ADFLTR2CON_CHNLID5_MASK                 0x00000020
#define _ADFLTR2CON_CHNLID5_LENGTH               0x00000001

#define _ADFLTR2CON_OVRSAM0_POSITION             0x0000000A
#define _ADFLTR2CON_OVRSAM0_MASK                 0x00000400
#define _ADFLTR2CON_OVRSAM0_LENGTH               0x00000001

#define _ADFLTR2CON_OVRSAM1_POSITION             0x0000000B
#define _ADFLTR2CON_OVRSAM1_MASK                 0x00000800
#define _ADFLTR2CON_OVRSAM1_LENGTH               0x00000001

#define _ADFLTR2CON_OVRSAM2_POSITION             0x0000000C
#define _ADFLTR2CON_OVRSAM2_MASK                 0x00001000
#define _ADFLTR2CON_OVRSAM2_LENGTH               0x00000001

#define _ADTRIG1_TRGSRC0_POSITION                0x00000000
#define _ADTRIG1_TRGSRC0_MASK                    0x0000001F
#define _ADTRIG1_TRGSRC0_LENGTH                  0x00000005

#define _ADTRIG1_TRGSRC1_POSITION                0x00000008
#define _ADTRIG1_TRGSRC1_MASK                    0x00001F00
#define _ADTRIG1_TRGSRC1_LENGTH                  0x00000005

#define _ADTRIG1_TRGSRC00_POSITION               0x00000000
#define _ADTRIG1_TRGSRC00_MASK                   0x00000001
#define _ADTRIG1_TRGSRC00_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC01_POSITION               0x00000001
#define _ADTRIG1_TRGSRC01_MASK                   0x00000002
#define _ADTRIG1_TRGSRC01_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC02_POSITION               0x00000002
#define _ADTRIG1_TRGSRC02_MASK                   0x00000004
#define _ADTRIG1_TRGSRC02_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC03_POSITION               0x00000003
#define _ADTRIG1_TRGSRC03_MASK                   0x00000008
#define _ADTRIG1_TRGSRC03_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC04_POSITION               0x00000004
#define _ADTRIG1_TRGSRC04_MASK                   0x00000010
#define _ADTRIG1_TRGSRC04_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC10_POSITION               0x00000008
#define _ADTRIG1_TRGSRC10_MASK                   0x00000100
#define _ADTRIG1_TRGSRC10_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC11_POSITION               0x00000009
#define _ADTRIG1_TRGSRC11_MASK                   0x00000200
#define _ADTRIG1_TRGSRC11_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC12_POSITION               0x0000000A
#define _ADTRIG1_TRGSRC12_MASK                   0x00000400
#define _ADTRIG1_TRGSRC12_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC13_POSITION               0x0000000B
#define _ADTRIG1_TRGSRC13_MASK                   0x00000800
#define _ADTRIG1_TRGSRC13_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC14_POSITION               0x0000000C
#define _ADTRIG1_TRGSRC14_MASK                   0x00001000
#define _ADTRIG1_TRGSRC14_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC2_POSITION                0x00000000
#define _ADTRIG2_TRGSRC2_MASK                    0x0000001F
#define _ADTRIG2_TRGSRC2_LENGTH                  0x00000005

#define _ADTRIG2_TRGSRC3_POSITION                0x00000008
#define _ADTRIG2_TRGSRC3_MASK                    0x00001F00
#define _ADTRIG2_TRGSRC3_LENGTH                  0x00000005

#define _ADTRIG2_TRGSRC20_POSITION               0x00000000
#define _ADTRIG2_TRGSRC20_MASK                   0x00000001
#define _ADTRIG2_TRGSRC20_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC21_POSITION               0x00000001
#define _ADTRIG2_TRGSRC21_MASK                   0x00000002
#define _ADTRIG2_TRGSRC21_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC22_POSITION               0x00000002
#define _ADTRIG2_TRGSRC22_MASK                   0x00000004
#define _ADTRIG2_TRGSRC22_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC23_POSITION               0x00000003
#define _ADTRIG2_TRGSRC23_MASK                   0x00000008
#define _ADTRIG2_TRGSRC23_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC24_POSITION               0x00000004
#define _ADTRIG2_TRGSRC24_MASK                   0x00000010
#define _ADTRIG2_TRGSRC24_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC30_POSITION               0x00000008
#define _ADTRIG2_TRGSRC30_MASK                   0x00000100
#define _ADTRIG2_TRGSRC30_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC31_POSITION               0x00000009
#define _ADTRIG2_TRGSRC31_MASK                   0x00000200
#define _ADTRIG2_TRGSRC31_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC32_POSITION               0x0000000A
#define _ADTRIG2_TRGSRC32_MASK                   0x00000400
#define _ADTRIG2_TRGSRC32_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC33_POSITION               0x0000000B
#define _ADTRIG2_TRGSRC33_MASK                   0x00000800
#define _ADTRIG2_TRGSRC33_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC34_POSITION               0x0000000C
#define _ADTRIG2_TRGSRC34_MASK                   0x00001000
#define _ADTRIG2_TRGSRC34_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC4_POSITION                0x00000000
#define _ADTRIG3_TRGSRC4_MASK                    0x0000001F
#define _ADTRIG3_TRGSRC4_LENGTH                  0x00000005

#define _ADTRIG3_TRGSRC5_POSITION                0x00000008
#define _ADTRIG3_TRGSRC5_MASK                    0x00001F00
#define _ADTRIG3_TRGSRC5_LENGTH                  0x00000005

#define _ADTRIG3_TRGSRC40_POSITION               0x00000000
#define _ADTRIG3_TRGSRC40_MASK                   0x00000001
#define _ADTRIG3_TRGSRC40_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC41_POSITION               0x00000001
#define _ADTRIG3_TRGSRC41_MASK                   0x00000002
#define _ADTRIG3_TRGSRC41_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC42_POSITION               0x00000002
#define _ADTRIG3_TRGSRC42_MASK                   0x00000004
#define _ADTRIG3_TRGSRC42_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC43_POSITION               0x00000003
#define _ADTRIG3_TRGSRC43_MASK                   0x00000008
#define _ADTRIG3_TRGSRC43_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC44_POSITION               0x00000004
#define _ADTRIG3_TRGSRC44_MASK                   0x00000010
#define _ADTRIG3_TRGSRC44_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC50_POSITION               0x00000008
#define _ADTRIG3_TRGSRC50_MASK                   0x00000100
#define _ADTRIG3_TRGSRC50_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC51_POSITION               0x00000009
#define _ADTRIG3_TRGSRC51_MASK                   0x00000200
#define _ADTRIG3_TRGSRC51_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC52_POSITION               0x0000000A
#define _ADTRIG3_TRGSRC52_MASK                   0x00000400
#define _ADTRIG3_TRGSRC52_LENGTH                 0x00000001

